lvx/base/Documents/бит_НазначениеСоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_НазначениеСоответствияАналитик</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ВидыСоответствийАналитик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СоответствияАналитик</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокАналитик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛеваяАналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПраваяАналитика_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_СоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствияАналитик</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_ВидыСоответствийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыСоответствийАналитик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соотношение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСоотношенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьПриПолномСовпаденииТипов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализироватьКорреспондирующийСчет</Name>
					<Comment>Анализировать корреспондирующий счет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Documents/бит_НазначениеСоответствияАналитик/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
	     ПодготовитьформуНаСервере();
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьформуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_НазначениеСоответствияАналитик";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСоответствияПриИзменении(Элемент)
	
	ИзменениеВидаСоответствия();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокАналитик

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_1Очистка(Элемент, СтандартнаяОбработка)
	
	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_2АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_2Очистка(Элемент, СтандартнаяОбработка)
	
	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_3АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикЛеваяАналитика_3Очистка(Элемент, СтандартнаяОбработка)
	
	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_1Очистка(Элемент, СтандартнаяОбработка)

	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_2АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_2Очистка(Элемент, СтандартнаяОбработка)

	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_3АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАналитикПраваяАналитика_3Очистка(Элемент, СтандартнаяОбработка)

	АналитикаОчистка(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидСоответствия) Тогда
		Отказ		   = Ложь;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", 
							"Заполнение", НСтр("ru = 'Вид соответствия'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ВидСоответствия", "Объект", Отказ); 
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьПараметрыВыбора(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если Объект.ВидСоответствия.Предопределенный 
		И Объект.ВидСоответствия.Код = "СтатьиОборотовБДР_СтатьиОборотовБДДС" Тогда
		
		// Для левой аналитики
		МассивПараметровЛев = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтатьи", Перечисления.бит_ТипыСтатейОборотов.БДР);
		МассивПараметровЛев.Добавить(НовыйПараметр);
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровЛев);            
		Элементы.СписокАналитикЛеваяАналитика_1.ПараметрыВыбора = ПараметрыВыбора;
		
		// Для правой аналитики
		МассивПараметровПрав = Новый Массив;
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипСтатьи", Перечисления.бит_ТипыСтатейОборотов.БДДС);
		МассивПараметровПрав.Добавить(НовыйПараметр);
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровПрав);            
		Элементы.СписокАналитикПраваяАналитика_1.ПараметрыВыбора = ПараметрыВыбора;
		
	Иначе
		
		// Для левой аналитики
		ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);            
		Элементы.СписокАналитикЛеваяАналитика_1.ПараметрыВыбора = ПараметрыВыбора;
		
		// Для правой аналитики
		ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);            
		Элементы.СписокАналитикПраваяАналитика_1.ПараметрыВыбора = ПараметрыВыбора;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьПараметрыВыбора()

&НаСервереБезКонтекста 
Функция ПодготовитьПараметрыАналитики(Источник, Путь)
	
	Структура = Новый Структура();
	Если НЕ Источник = Неопределено Тогда
		Если Источник[Путь + "Показывать"] Тогда
			ПустойПараметрАналитики(Структура);
			Структура.Вставить("Код"	         , СокрЛП(Источник[Путь + "Код"]));
			Структура.Вставить("Наименование"	 , СокрЛП(Источник[Путь + "Наименование"]));
			Структура.Вставить("ТипЗначения"	 , Источник[Путь + "ТипЗначения"]);
			Структура.Вставить("Показывать"	     , Источник[Путь + "Показывать"]);
		Иначе
			ПустойПараметрАналитики(Структура);
		КонецЕсли; 
	Иначе
		ПустойПараметрАналитики(Структура);
	КонецЕсли; 
	
	Возврат Структура;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПустойПараметрАналитики(Знач Структура)
	
	Структура.Вставить("Код"	         , "");
	Структура.Вставить("Наименование"	 , "");
	Структура.Вставить("ТипЗначения"	 , Новый ОписаниеТипов("Неопределено"));
	Структура.Вставить("Показывать"	     , Ложь);

КонецПроцедуры // ПодготовитьПараметрыАналитик()

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыАналитик(ВидСоответствия, НастройкиИзмерений, ЛевоПраво)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
	Запрос.УстановитьПараметр("ПустойПВХ", ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.ЛеваяАналитика_1.Наименование КАК ЛеваяАналитика_1Наименование,
	|	Реквизиты.ЛеваяАналитика_1.Код КАК ЛеваяАналитика_1Код,
	|	Реквизиты.ЛеваяАналитика_1.ТипЗначения КАК ЛеваяАналитика_1ТипЗначения,
	|	Реквизиты.ЛеваяАналитика_2.Наименование КАК ЛеваяАналитика_2Наименование,
	|	Реквизиты.ЛеваяАналитика_2.ТипЗначения КАК ЛеваяАналитика_2ТипЗначения,
	|	Реквизиты.ЛеваяАналитика_2.Код КАК ЛеваяАналитика_2Код,
	|	Реквизиты.ЛеваяАналитика_3.Наименование КАК ЛеваяАналитика_3Наименование,
	|	Реквизиты.ЛеваяАналитика_3.ТипЗначения КАК ЛеваяАналитика_3ТипЗначения,
	|	Реквизиты.ЛеваяАналитика_3.Код КАК ЛеваяАналитика_3Код,
	|	Реквизиты.ПраваяАналитика_1.Наименование КАК ПраваяАналитика_1Наименование,
	|	Реквизиты.ПраваяАналитика_1.ТипЗначения КАК ПраваяАналитика_1ТипЗначения,
	|	Реквизиты.ПраваяАналитика_1.Код КАК ПраваяАналитика_1Код,
	|	Реквизиты.ПраваяАналитика_2.Наименование КАК ПраваяАналитика_2Наименование,
	|	Реквизиты.ПраваяАналитика_2.ТипЗначения КАК ПраваяАналитика_2ТипЗначения,
	|	Реквизиты.ПраваяАналитика_2.Код КАК ПраваяАналитика_2Код,
	|	Реквизиты.ПраваяАналитика_3.Наименование КАК ПраваяАналитика_3Наименование,
	|	Реквизиты.ПраваяАналитика_3.ТипЗначения КАК ПраваяАналитика_3ТипЗначения,
	|	Реквизиты.ПраваяАналитика_3.Код КАК ПраваяАналитика_3Код,
	|	НЕ Реквизиты.ЛеваяАналитика_1 = &ПустойПВХ КАК ЛеваяАналитика_1Показывать,
	|	НЕ Реквизиты.ЛеваяАналитика_2 = &ПустойПВХ КАК ЛеваяАналитика_2Показывать,
	|	НЕ Реквизиты.ЛеваяАналитика_3 = &ПустойПВХ КАК ЛеваяАналитика_3Показывать,
	|	НЕ Реквизиты.ПраваяАналитика_1 = &ПустойПВХ КАК ПраваяАналитика_1Показывать,
	|	НЕ Реквизиты.ПраваяАналитика_2 = &ПустойПВХ КАК ПраваяАналитика_2Показывать,
	|	НЕ Реквизиты.ПраваяАналитика_3 = &ПустойПВХ КАК ПраваяАналитика_3Показывать
	|ИЗ
	|	Справочник.бит_ВидыСоответствийАналитик КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ВидСоответствия";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Выборка = Неопределено;	
	КонецЕсли; 
	
	Для каждого Сторона Из ЛевоПраво Цикл
		НастройкиИзмерений.Вставить(Сторона.Ключ, ПодготовитьПараметрыАналитики(Выборка, Сторона.Ключ));
	КонецЦикла;

КонецПроцедуры // ЗаполнитьПараметрыАналитик()

&НаКлиентеНаСервереБезКонтекста
Функция ПривестиТипЗначения(ПараметрыАналитик, ИмяПоля, ИсходноеЗначение)

	Результат = ПараметрыАналитик[ИмяПоля].ТипЗначения.ПривестиЗначение(ИсходноеЗначение);

	Возврат Результат;
	
КонецФункции // ПривестиТипЗначения()

&НаСервереБезКонтекста
Процедура ПривестиТипыЗначений(Объект, ЛевоПраво, ПараметрыАналитик)
	
	Для каждого СтрокаТаблицы Из Объект.СписокАналитик Цикл
		Для каждого Сторона Из ЛевоПраво Цикл
			СтрокаТаблицы[Сторона.Ключ] = ПривестиТипЗначения(ПараметрыАналитик, Сторона.Ключ, СтрокаТаблицы[Сторона.Ключ]);
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ЛевоПраво = Новый Структура();
	Для Й = 1 По 3 Цикл
		ЛевоПраво.Вставить("ЛеваяАналитика_" + Й);
		ЛевоПраво.Вставить("ПраваяАналитика_" + Й);
	КонецЦикла; 
	
	НастройкиИзмерений = Новый Структура(); 
	НастройкиИзмерений.Вставить("НастройкиАналитик", бит_МеханизмДопИзмерений.ПолучитьНастройкиДополнительныхАналитик());
	НастройкиИзмерений.Вставить("ПараметрыАналитик", Новый Структура);
	
	ИзменениеВидаСоответствия();
	
КонецПроцедуры // ПодготовитьформуНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;

	Если НЕ ЗначениеЗаполнено(Объект.ВидСоответствия) Тогда
		СвойстваЭлементов = Новый СписокЗначений; 
		СвойстваЭлементов.Добавить("СписокАналитикЛеваяАналитика_%1", НСтр("ru = 'Аналитика источника № %1'"));
		СвойстваЭлементов.Добавить("СписокАналитикПраваяАналитика_%1", НСтр("ru = 'Аналитика приемника № %1'"));
		
		Для каждого ЭлементСписка Из СвойстваЭлементов Цикл
			Для Индекс = 1 По 3 Цикл
				ИмяЭлемента = СтрШаблон(ЭлементСписка.Значение, Индекс);
				Элементы[ИмяЭлемента].Заголовок   = СтрШаблон(ЭлементСписка.Представление, Индекс);
				Элементы[ИмяЭлемента].Доступность = Ложь;
				Элементы[ИмяЭлемента].Видимость   = Истина;
			КонецЦикла; 
		КонецЦикла; 
	Иначе	
		ПараметрыАналитик = Форма.НастройкиИзмерений.ПараметрыАналитик;
		Для каждого Сторона Из Форма.ЛевоПраво Цикл
			ИмяЭлемента = СтрШаблон("СписокАналитик%1", Сторона.Ключ);
			Элементы[ИмяЭлемента].Заголовок   = ПараметрыАналитик[Сторона.Ключ].Наименование;
			Элементы[ИмяЭлемента].Видимость   = ПараметрыАналитик[Сторона.Ключ].Показывать;
			Элементы[ИмяЭлемента].Доступность = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ВидСоответствия.Подсказка = Строка(Форма.СоотношениеВидаСоответствия);
	
КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура ИзменениеВидаСоответствия()
	
	ЗаполнитьПараметрыАналитик(Объект.ВидСоответствия, НастройкиИзмерений.ПараметрыАналитик, ЛевоПраво);	
	ПривестиТипыЗначений(Объект, ЛевоПраво, НастройкиИзмерений.ПараметрыАналитик);
	УстановитьПараметрыВыбора(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.ВидСоответствия) Тогда
		СоотношениеВидаСоответствия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидСоответствия, "Соотношение");	
	Иначе
		СоотношениеВидаСоответствия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ИзменениеВидаСоответствия()

&НаКлиенте
Процедура АналитикаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокАналитик.ТекущиеДанные;
	ИмяЭлемента  = СтрЗаменить(Элемент.Имя, "СписокАналитик", "");

	ТекПараметры = НастройкиИзмерений.ПараметрыАналитик[ИмяЭлемента];
	ТекНастройка = НастройкиИзмерений.НастройкиАналитик[ТекПараметры.Код];
	
	Если ТекНастройка = Неопределено Тогда 			
		СтандартнаяОбработка = Ложь;   			
	Иначе 					
		СтрНастройки = Новый Структура(ИмяЭлемента, ТекНастройка); 				
		бит_МеханизмДопИзмеренийКлиент.ВыбратьТипСоставнойАналитики(ЭтотОбъект, Элемент, 
			ТекущиеДанные, ИмяЭлемента, СтандартнаяОбработка, СтрНастройки); 			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АналитикаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокАналитик.ТекущиеДанные;
	ИмяЭлемента   = СтрЗаменить(Элемент.Имя, "СписокАналитик", "");
	
	ТекущиеДанные[ИмяЭлемента]  = Неопределено;
	ТекущиеДанные[ИмяЭлемента]  = ПривестиТипЗначения(НастройкиИзмерений.ПараметрыАналитик,
									ИмяЭлемента, ТекущиеДанные[ИмяЭлемента]);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Период = ?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, ТекущаяДатаСеанса());
	Запрос = Новый Запрос(); 
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидСоответствия", Объект.ВидСоответствия);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачалоИспользования.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	НачалоИспользования.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	НачалоИспользования.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	НачалоИспользования.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	НачалоИспользования.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	НачалоИспользования.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	НачалоИспользования.Используется КАК Используется,
	|	НачалоИспользования.Период КАК ДатаНачала,
	|	КонецИспользования.Период КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(&Период, ВидСоответствия = &ВидСоответствия) КАК НачалоИспользования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик.СрезПервых(&Период, ВидСоответствия = &ВидСоответствия) КАК КонецИспользования
	|		ПО НачалоИспользования.ЛеваяАналитика_1 = КонецИспользования.ЛеваяАналитика_1
	|			И НачалоИспользования.ЛеваяАналитика_2 = КонецИспользования.ЛеваяАналитика_2
	|			И НачалоИспользования.ЛеваяАналитика_3 = КонецИспользования.ЛеваяАналитика_3
	|			И (НачалоИспользования.Используется)
	|			И (КонецИспользования.Используется = ЛОЖЬ)
	|ГДЕ
	|	НачалоИспользования.Используется"; 
	
	Объект.СписокАналитик.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти
